Tekla.Structures.ModelInternal.BimModelDataProduct.Constants
Constants for the Bim Model Data Product API base URLs based on deployment environments.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.DefaultFileOperationTimeoutInMinutes
File upload timeout in minutes

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MaxFileSizeInBytes
Specifies the maximum allowed file size for cloud upload in bytes.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TrimBimFileExtension
Represents the file extension used for TrimBIM files.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.SemanticTrimBimFileExtension
Represents the file extension used for semantic trim BIM files.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.SemanticDbFileExtension
Represents the file extension used for semantic database files (i.e. TrimBim + Semantic Trimbim schema for lumo database).

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TrimBimExportType
Represents the export type identifier for the TrimBIM format.
Remarks: This constant is used to specify the TrimBIM export format in operations that require
an export type.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.SemanticTrimBimExportType
Represents the export type identifier for semantic trim BIM exports.
Remarks: This constant is used to specify the Semantic TrimBIM export format in operations that require
an export type.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.SemanticDbExportType
Represents the export type identifier for Semantic Database operations.
Remarks: This constant is used to specify the export type as "SemanticDb" in scenarios where
Semantic Database functionality is required. It can be used as a key or identifier in configurations or
export-related operations.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.ExportType
Specifies the type of export operation as "transform".
Remarks: This constant can be used to identify or categorize export operations that involve
transformations.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.PermissionWrite
Represents the permission level for write access in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.PermissionRead
Represents the permission level for read access in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.PermissionAdmin
Represents the permission level for admin access in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.PermissionNone
Represents the removal of permission access in the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataDescription
Represents the metadata key for the description of a cloud model.
Remarks: This constant can be used to identify or retrieve the description metadata associated
with a cloud model.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataOriginalModelId
Represents the metadata key used to identify the original model ID.
Remarks: This constant can be used as a key in metadata dictionaries or similar structures to
store or retrieve the identifier of the original model associated with an entity.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataOriginalModelName
Represents the metadata key used to identify the original model name.
Remarks: This constant can be used as a key in metadata dictionaries or similar structures to
store or retrieve the display information of the original model associated with an entity.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataModelSource
Represents the metadata key used to identify the source of the model, typically the originating product
name.
Remarks: This constant can be used as a key in metadata dictionaries or other data structures
where the source of the model needs to be specified.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataModelSourceVersion
Represents the metadata key for the source version of the model.
Remarks: This constant is used to identify the version of the originating product in
metadata.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.MetadataTrimbleConnectProjectId
Represents the metadata key for the Trimble Connect project ID.
Remarks: This constant can be used to identify or retrieve the Trimble Connect project ID
from a metadata collection. The value of this constant is "TrimbleConnectProjectId".

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.AuthorName
Represents the key used to identify the author's name in a cloud request.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.AuthorOrganizationName
Represents the key used to identify the author's name in a cloud request.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.AuthorEmail
Represents the key used to identify the author's email address in a metadata collection.
Remarks: This constant can be used as a key in dictionaries or other data structures where the
author's email address is stored or retrieved.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.PermissionTypeUser
Represents the permission type for a user.
Remarks: This constant is used to specify that the associated permission applies to a
user. This differentiates from permissions granted at group or organization level

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.UserOrganizationId
Represents the key used to identify the organization ID associated with a user.
Remarks: This constant is typically used as a key in dictionaries or other data structures
where user-related information is stored or retrieved.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.UserOrganizationName
Represents the name of the organization associated with a user.
Remarks: This constant can be used as a key or identifier in contexts where the user's
organization name is required.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.UserName
Represents the default display name for a user.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.UserEmail
Represents the key used to identify a user's email address in a configuration or data store.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.UserId
Represents the key used to identify the user

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.ModelSource
Represents the source model identifier for Tekla Structures.
Remarks: This constant is used to specify the model source as "Tekla Structures" when
reporting product information to the cloud.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.WorkflowName
Represents the name of the workflow used in the cloud processing system.
Remarks: This constant specifies the default workflow name as "structural". It can be used to
identify or configure workflows in scenarios where a predefined name is required.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.DataProductSchemaVersion
Represents the version of the data product schema.
Remarks: This constant specifies the current version of the schema used for data products.  It
can be used to ensure compatibility between different components or systems that rely on the same schema
version.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.ProjectIdUDA
Represents the unique identifier for the connected project in the Trimble Hub.
Remarks: This constant is used as a key to identify the project ID in the context of Trimble
Hub integrations.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TCRegionEurope
Represents the region identifier for Europe.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TCRegionNorthAmerica
Represents the region identifier for North America.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TCRegionAsia
Represents the region identifier for Asia.

Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TCRegionAustralia
Represents the region identifier for Australia.